/* Операційна система дає змогу користувачу обрати спосіб авторизації: Це
може бути авторизація за допомогою паролю (вірний пароль задається
літералом), або авторизація PIN кодом (вірний PIN – 4 цифри, задається
літералом), або авторизація за допомогою відбитку пальця ( для простоти
вважати, що відбиток пальця завжди вірний). Авторизованому
користувачу система повинна передати повідомлення "Ласкаво просимо!"
*/


module.exports = class Login {
    authorize(data) {
        this._login(data);
        // other operations
    }
    _login(data) {
        console.log("Ласкаво просимо!")
    }
}